'''
===================================================================================================================================
문제
===================================================================================================================================
[10828] 스택
===================================================================================================================================
Log
===================================================================================================================================
' 2022-03-06-SUN : 문제 파악
                   시간 초과
                   readline으로 입력 받음 -> 틀렸습니다.
                   readline으로 입력받으면 문자열일 때 마지막에 개행문자까지 추가됨 -> order[:-1]과 비교
                   문제 해결
===================================================================================================================================
'''

'''
1. push: list.append()
2. pop: list.pop()
3. size: print(len(list))
4. empty: if list: -> true
5. top: if list: -> print(list[-1]) else: -> print(-1)
'''

import sys
input = sys.stdin.readline

# 입력
N = int(input())
stack = []
for _ in range(N):
    order = input()
    
    if order[:4] == 'push':
        _, num = order.split()
        stack.append(int(num))
        
    elif order[:-1] == 'pop':
        if stack:
            print(stack[-1])
            stack.pop()
        else:
            print(-1)
        
    elif order[:-1] == 'size':
        print(len(stack))
    
    elif order[:-1] == 'empty':
        if stack:
            print(0)
        else:
            print(1)
            
    else:
        if stack:
            print(stack[-1])
        else:
            print(-1)