'''
===================================================================================================================================
문제
===================================================================================================================================
[11866] 요세푸스 문제 0
===================================================================================================================================
Log
===================================================================================================================================
' 2022-03-23-WED : 문제 파악
                   5%에서 틀렸습니다.
                   FOR문에서 범위 실수 해결
                   문제 해결
===================================================================================================================================
'''
'''
Algorithm
Queue 구현 - deque library 사용
1. queue에 1부터 N까지 숫자로 채움
2. append(queue[0]), popleft()를 두 번 수행
3. print(queue[0]), popleft() 수행
4. queue가 빌 때까지 반복
'''

from collections import deque
N, K = map(int, input().split())
queue = deque([i for i in range(1, N+1)])
answer = []
while queue:
    # append, popleft 두 번 수행
    for _ in range(K - 1):
        queue.append(queue[0])
        queue.popleft()

    # print, popleft 수행
    answer.append(queue[0])
    queue.popleft()

print('<', end = '')
for i in range(len(answer)):
    if i == len(answer) - 1:
        print(answer[i], end = '>')
    else:
        print(answer[i], end = ', ')
    