'''
===================================================================================================================================
문제
===================================================================================================================================
[1316] 그룹 단어 체커
===================================================================================================================================
Log
===================================================================================================================================
' 2022-04-15 FRI : 문제 파악
                   문제 해결
===================================================================================================================================
'''
'''
Algorithm
1. 입력 받은 단어를 한 글자 씩 보면서 리스트에 이미 들어있는지 확인
2. 이미 들어있는 글자가 있다면 다음 단어 확인
3. 끝까지 이미 들어있는 글자가 없다면 그룹 단어
'''

import sys
input = sys.stdin.readline

N = int(input())
answer = 0
for _ in range(N):
    word = input().rstrip()
    check = [word[0]]
    flag = True # 그룹 단어인 경우 True
    for index in range(1, len(word)):
        # 이전 index의 글자와 현재 index의 글자가 같으면 continue
        if word[index-1] == word[index]:
            continue
        
        # 현재 index의 글자가 이미 리스트에 들어있다면 다음 단어 확인
        if word[index] in check:
            flag = False
            break
        elif index == len(word)-1:
            flag = True
        check.append(word[index])
    
    # flag가 True인 경우 그룹 단어
    if flag:
        answer += 1
print(answer)