'''
===================================================================================================================================
문제
===================================================================================================================================
[13305] 주유소
===================================================================================================================================
Log
===================================================================================================================================
' 2022-03-04-FRI : 문제 파악
                   부분 성공(1번) - 17점
                   문제 해결
===================================================================================================================================
'''

'''
1. 도로의 길이, 리터 당 가격 각 리스트에 담음
2. 리터 당 가격이 감소하는 시점 찾기
3. 리터 당 가격 i 부터 i+1까지 비용 계산
'''

import sys
input = sys.stdin.readline

# 입력
N = int(input())
length = list(map(int, input().split()))
cost = list(map(int, input().split()))

answer = 0
list_ = [0]
# 감소하는 시점 찾아 각 index를 list에 저장
index = 0
for i in range(1, len(cost)):
    if cost[index] >= cost[i]:
        list_.append(i)
        index = i
    
if list_[-1] != len(cost) - 1:
    list_.append(len(cost) - 1)
    
# i부터 i+1까지 비용 계산
for i in range(len(list_)-1):
    sum_ = sum(length[list_[i]:list_[i+1]])
    answer += cost[list_[i]]*sum_
print(answer)