'''
===================================================================================================================================
문제
===================================================================================================================================
[14226] 이모티콘
===================================================================================================================================
Log
===================================================================================================================================
' 2022-05-18 WED : 문제 파악
                   예제 4에서 틀림
===================================================================================================================================
'''
'''
Algorithm
1. 현재 화면의 이모티콘이 S보다 작으면
   -> 현재 화면의 이모티콘 개수 * 2와 현재 화면의 이모티콘 개수 + 클립보드의 이모티콘 개수 중 S와 더 비슷한 것으로 수행
2. 현재 화면의 이모티콘이 S보다 크면 삭제
3. 현재 화면의 이모티콘이 S와 같으면 BREAK
'''

S = int(input())
display = 1
time = 0
clipboard = 0
while True:
    
    # 현재 화면의 이모티콘이 S보다 작으면
    if display < S:
        # 현재 화면의 이모티콘 개수 *2가 더 S에 먼 경우
        if clipboard > 0 and abs(S-display*2) > abs(S-(display+clipboard)):
            display += clipboard
            time += 1
            
        else:
            clipboard = display
            display *= 2
            time += 2
    elif display > S:
        display -= 1
        time += 1
    else:
        break
print(time)