'''
===================================================================================================================================
문제
===================================================================================================================================
[15652] N과 M (4)
===================================================================================================================================
Log
===================================================================================================================================
' 2022-04-04-MON : 문제 파악
                   문제 해결
' 2022-04-05 TUE : 코드 최적화
===================================================================================================================================
'''
'''
Algorithm
백트래킹 사용
1. for문을 돌면서 숫자 추가
1.1. stack이 비어있으면 바로 추가
1.2. stack이 비어있지 않으면 num이 stack의 마지막 원소보다 크거나 같을 때만 추가
2. 재귀함수 호출
3. 재귀함수 return되면 pop
4. stack의 길이가 M이 되면 print
'''

def back_tracking():
    
    # stack의 길이가 M이 되면 print
    if len(stack) == M:
        print(' '.join(list(map(str, stack))))
    else:
        for num in range(1, N+1):
            # stack이 비어있으면 그냥 추가
            if not stack:
                stack.append(num)
                back_tracking()
                stack.pop()
            elif stack[-1] <= num: # 그렇지 않으면 stack의 마지막 원소보다 크거나 같을 때만 추가
                stack.append(num)
                back_tracking()
                stack.pop()

N, M = map(int, input().split())
stack = []
back_tracking()