'''
===================================================================================================================================
문제
===================================================================================================================================
[15651] N과 M (3)
===================================================================================================================================
Log
===================================================================================================================================
' 2022-04-04-MON : 문제 파악
                   문제 해결
' 2022-04-05 TUE : 코드 최적화
===================================================================================================================================
'''
'''
Algorithm
itertools library 이용
1. product(중복 순열) 이용해 모든 조합 만들기
2. 리스트 정렬 후 출력

백트래킹 사용
1. for문을 돌면서 stack에 숫자 추가하고 재귀함수 호출
2. 재귀함수 return되면 pop
3. stack의 길이가 M이 되면 stack print
'''
from itertools import product

def back_tracking():
    
    # stack 길이가 M이 되면 print
    if len(stack) == M:
        print(' '.join(list(map(str, stack))))
    else:
        # 1부터 N까지 순서대로 stack에 append
        for num in range(1, N+1):
            stack.append(num)
            # 재귀함수 호출
            back_tracking()
            # 재귀함수 return되면 pop
            stack.pop()

def use_product():
    nums = list(product(range(1, N+1), repeat = M))
    nums.sort()
    for num in nums:
        print(' '.join(list(map(str, num))))
        
N, M = map(int, input().split())
stack = []
# back_tracking()
use_product()