'''
===================================================================================================================================
문제
===================================================================================================================================
[15657] N과 M (8)
===================================================================================================================================
Log
===================================================================================================================================
' 2022-04-05 TUE : 문제 파악
                   문제 해결
===================================================================================================================================
'''
'''
Algorithm
백트래킹 이용
1. 입력 리스트 오름차순 정렬
2. for문을 돌면서 stack 비었는지 확인하며 숫자 append
2.1. stack 비어있으면 바로 append
2.2. stack 비어있지 않으면 num이 stack 마지막 원소보다 크거나 같은 경우에만 append
3. 재귀함수 호출
4. 재귀함수 return되면 pop
5. stack의 길이가 M이 되면 print
'''

def back_tracking():
    
    # stack 길이가 M이 되면 print
    if len(stack) == M:
        print(' '.join(list(map(str, stack))))
    else:
        for num in nums:
            # stack 비어있으면 num append
            if not stack:
                stack.append(num)
                back_tracking()
                stack.pop()
            # 그렇지 않으면 stack 마지막 원소보다 크거나 같은 값만 append
            elif stack[-1] <= num:
                stack.append(num)
                back_tracking()
                stack.pop()
                
N, M = map(int, input().split())
nums = list(map(int, input().split()))
nums.sort()

stack = []
back_tracking()