'''
===================================================================================================================================
문제
===================================================================================================================================
[15655] N과 M (6)
===================================================================================================================================
Log
===================================================================================================================================
' 2022-04-05 TUE : 문제 파악
                   문제 해결
===================================================================================================================================
'''
'''
Algorithm
백트래킹 이용
1. 입력 리스트 오름차순 정렬
2. for문을 돌면서 stack이 비었는지 확인해 숫자 append
2.1. stack이 비었으면 바로 append
2.2. stack이 안비었으면 stack에 없고 stack 마지막 원소보다 큰 숫자만 append
3. 재귀함수 호출
4. 재귀함수 return되면 pop
5. stack의 길이가 M이 되면 print
'''

def back_tracking():
    
    # stack의 길이가 M이 되면 print
    if len(stack) == M:
        print(' '.join(list(map(str, stack))))
    else:
        for num in nums:
            # stack 비어있으면 숫자 append
            if not stack:
                stack.append(num)
                back_tracking()
                stack.pop()
            # stack에 없고 stack 마지막 원소보다 크면 append
            elif num not in stack and num > stack[-1]:
                stack.append(num)
                back_tracking()
                stack.pop()
                
N, M = map(int, input().split())
nums = list(map(int, input().split()))
nums.sort()
stack = []
back_tracking()