'''
===================================================================================================================================
문제
===================================================================================================================================
[1654] 랜선 자르기
===================================================================================================================================
Log
===================================================================================================================================
' 2022-03-08-TUE : 문제 파악
                   문제 해결
===================================================================================================================================
'''

'''
1. 이진 탐색 - 재귀 이용
2. 랜선의 길이를 mid로 보고 mid가 가장 클 때의 랜선의 길이 출력
'''

import sys
sys.stdin.readline

def binary_search(start, end):
    global answer
    
    # 찾는 값이 없으면 None Return
    if start > end:
        return None
    
    mid = (start + end) // 2
    
    # mid가 0이 되면 None Return
    if mid == 0:
        return None
    
    # mid의 길이로 몇 개의 랜선을 만들 수 있는지 확인
    total = 0
    for i in length:
        total += i // mid
    
    # mid의 길이로 잘랐을 때 N개의 랜선을 만들 수 있으면 최댓값 찾기
    if total >= N:
        answer = mid
        return binary_search(mid + 1, end)
    else: # mid의 길이로 잘랐을 때 N개의 랜선을 만들 수 없으면 mid의 값을 줄여 다시 탐색
        return binary_search(start, mid - 1)

# 입력
K, N = map(int, input().split())
length = []
for _ in range(K):
    length.append(int(input()))

answer = 0
binary_search(1, max(length))
print(answer)