'''
===================================================================================================================================
문제
===================================================================================================================================
[2343] 기타 레슨
===================================================================================================================================
Log
===================================================================================================================================
' 2022-03-09-WED : 문제 파악
                   틀렸습니다.
===================================================================================================================================
'''
'''
Algorithm
이진 탐색 - 반복문
mid : Blueray의 크기
1. for문 돌면서 강의의 길이를 누적합
1.1. for문 index : 강의
2. 누적합이 mid를 넘어가면 blueray index 증가하고 누적합 현재 강의 길이로 초기화
3. blueray index가 M개를 넘어가면 mid 증가시켜 다시 탐색
4. blueray index가 M개를 넘어가지 않으면 mid값의 최솟값 갱신

'''

import sys
input = sys.stdin.readline

# 입력
N, M = map(int, input().split())
length = list(map(int, input().split()))

# start, end 초기화
start = max(length)
end = sum(length)

# 이진 탐색
answer = 0
while start <= end:
    
    mid = (start + end) // 2
    sum_ = 0
    blueray_index = 0
    for now in length:
        
        # 누적합이 mid를 넘어가는지 확인
        if sum_ + now > mid:
            # blueray index 증가
            blueray_index += 1
            # 누적합 현재 0으로 초기화
            sum_ = 0
        
        sum_ += now
    
    # blueray index가 M보다 많아지면 mid 증가시켜 다시 탐색
    if blueray_index > M - 1:
        start = mid + 1
    else: # 정상적이라면 mid 감소시켜 최솟값 찾기
        end = mid - 1
        answer = mid

print(answer)